---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures
source: html/6c670503-f89e-7ee3-1883-af2a9576f390.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures

Failures about DividedSurface.

## Syntax (C#)
```csharp
public static class DividedSurfaceFailures
```